libxmlbus/data/wsaddr-testset/documents/echo/soap11/message9.xml

<?xml version="1.0"?>
<!-- $Id: message9.xml,v 1.4 2006/01/19 06:05:30 hugo Exp $ -->
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <env:Header>
    <wsa:Action>http://example.org/action/echoIn</wsa:Action>
    <wsa:To>http://www.w3.org/2005/08/addressing/anonymous</wsa:To>
    <wsa:MessageID>urn:uuid:BAB79B77-E9AE-4B9F-A8B4-624BB9E7E919</wsa:MessageID>
    <wsa:ReplyTo>
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
      <wsa:ReferenceParameters xmlns:customer="http://example.org/customer">
        <customer:CustomerKey>Key#123456789</customer:CustomerKey>
      </wsa:ReferenceParameters>
    </wsa:ReplyTo>
    <wsa:FaultTo>
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
      <wsa:ReferenceParameters xmlns:customer="http://example.org/customer">
        <customer:CustomerKey>Fault#123456789</customer:CustomerKey>
      </wsa:ReferenceParameters>
    </wsa:FaultTo>
  </env:Header>
  <env:Body>
    <m:echoIn xmlns:m="http://example.org/echo"/>
  </env:Body>
</env:Envelope>
